app/controllers/participants_controller.rb

  def index
    @participants = Participant.all
---
SELECT * FROM `participants`

  def show
    @participant = Participant.find(params[:id])
---
SELECT * FROM `participants` WHERE (`participants`.`id` = 0)

  def edit
    @participant = Participant.find(params[:id])
---
SELECT * FROM `participants` WHERE (`participants`.`id` = 4)

  def create
    @participant = Participant.new(params[:participant])

    respond_to do |format|
      if @participant.save
---
INSERT INTO "participants" ("name", "created_at", "updated_at", "email") VALUES('Rodrigo Souto', '2009-10-21 03:00:47', '2009-10-21 03:00:47', 'diguliu@gmail.com')

  def update
    @participant = Participant.find(params[:id])

    respond_to do |format|
      if @participant.update_attributes(params[:participant])
---
SELECT * FROM `participants` WHERE (`participants`.`id` = 4)
UPDATE `participants` SET `updated_at` = '2009-09-02 03:24:08', `name` = 'Rodrigo Nunes Souto' WHERE `id` = 4

  def destroy
    @participant = Participant.find(params[:id])
    @participant.destroy
---
SELECT * FROM `participants` WHERE (`participants`.`id` = 1)
DELETE FROM `participants` WHERE `id` = 1

  def join
  	@participant = Participant.find(params[:participant][:id])
	@meeting = Meeting.find(params[:meeting][:id])
---
SELECT * FROM `participants` WHERE (`participants`.`id` = '--- :participant\n')
SELECT * FROM `meetings` WHERE (`meetings`.`id` = '--- :meeting\n')

  def disjoin
  	@participant = Participant.find(params[:participant][:id])
	@meeting = Meeting.find(params[:meeting][:id])
---
SELECT * FROM `participants` WHERE (`participants`.`id` = 7)
SELECT * FROM `meetings` WHERE (`meetings`.`id` = 3)